src/Catalogs/МедицинскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МедицинскиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМедицинскойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБезНулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеМедКартыОртодонтПациента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыПолиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПолиса</Name>
			<Comment>Типы полисов клиентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеМедицинскоеСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеМедицинскоеСтрахование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПолисыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПолисыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПолиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаПрикрепления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МедицинскиеКарты/Forms/ФормаОртодонтическогоПациента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)      	
	
	ХранилищеПечатнойФормы = КартаОртодонтическогоПациента.Ссылка.ПечатнаяФорма.Получить();		 		 		
	
	Если НЕ ЗначениеЗаполнено(ХранилищеПечатнойФормы) Тогда	
		ПолеТекстHTML = Справочники.МедицинскиеКарты.ПолучитьМакет("МедицинскаяКартаОртодонтическогоПациента").ПолучитьТекст();			
		
		ПФ_Ортодонт_Лицо = Гипертекст.ПолучитьАдресКартинкиHTML(БиблиотекаКартинок.ПФ_Ортодонт_Лицо);
		ПФ_Ортодонт_Лицо_Профиль = Гипертекст.ПолучитьАдресКартинкиHTML(БиблиотекаКартинок.ПФ_Ортодонт_Лицо_Профиль);
		ПФ_Ортодонт_ЗубФормула = Гипертекст.ПолучитьАдресКартинкиHTML(БиблиотекаКартинок.ПФ_Ортодонт_ЗубФормула);
		ПФ_Ортодонт_Зубы1 = Гипертекст.ПолучитьАдресКартинкиHTML(БиблиотекаКартинок.ПФ_Ортодонт_Зубы1);
		ПФ_Ортодонт_Зубы2 = Гипертекст.ПолучитьАдресКартинкиHTML(БиблиотекаКартинок.ПФ_Ортодонт_Зубы2);
		
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ПФ_Ортодонт_Лицо}", ПФ_Ортодонт_Лицо);
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ПФ_Ортодонт_Лицо_Профиль}", ПФ_Ортодонт_Лицо_Профиль);
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ПФ_Ортодонт_ЗубФормула}", ПФ_Ортодонт_ЗубФормула);
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ПФ_Ортодонт_Зубы1}", ПФ_Ортодонт_Зубы1);
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ПФ_Ортодонт_Зубы2}", ПФ_Ортодонт_Зубы2);
		
		ПервоначальноеПолучениеЛичныхДанныхОртодонтическогоПациента();				
		
	Иначе 
		ПолеТекстHTML = ХранилищеПечатнойФормы;		
	КонецЕсли; 
	
КонецПроцедуры    

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция формирует печатную форму ортодонтического пациента.
//
Процедура ПервоначальноеПолучениеЛичныхДанныхОртодонтическогоПациента()		
	
	НазваниеОрганизации = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация;
	Если ЗначениеЗаполнено(НазваниеОрганизации) Тогда
		Если НазваниеОрганизации.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес)).Количество() > 0 Тогда
			АдресОрганизации = НазваниеОрганизации.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;	 
		КонецЕсли;
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ОКПО}", НазваниеОрганизации.КодПоОКПО);  
	Иначе
		АдресОрганизации = "";
	КонецЕсли; 
	
	НомерКарты = ФормированиеПечатныхФорм.УдалитьЛидирующиеНулиИзНомераОбъекта(КартаОртодонтическогоПациента.Код);
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НомерМедкарты}", НомерКарты);  
		
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ДатаРожденияКлиента КАК ДатаРожденияКлиента,
	|	Контрагенты.ПолКлиента КАК ПолКлиента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Пациент");
	
	Запрос.УстановитьПараметр("Пациент", КартаОртодонтическогоПациента.ВладелецКарты);
	Выборка = Запрос.Выполнить().Выбрать();     
	
	// Заполняем общие данные
	Пока Выборка.Следующий() Цикл	                                 
		ФИОПациента = Выборка.Ссылка;
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ФИОПациента}", ФИОПациента);    
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ДатаЗаполнения}", Лев(ТекущаяДата(), 10));   
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НаименованиеОрганизации}", НазваниеОрганизации);  
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{АдресОрганизации}", АдресОрганизации);  
		Если Выборка.ДатаРожденияКлиента <> Дата(1,1,1) Тогда
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ДРЧисло}", День(Выборка.ДатаРожденияКлиента));  
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ДРМесяц}", Месяц(Выборка.ДатаРожденияКлиента));  
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{ДРГод}", Год(Выборка.ДатаРожденияКлиента));  				
		КонецЕсли;
	КонецЦикла;                                                                             
	
	// Заполняем Контактную информацию
	КИПациента = ФИОПациента.КонтактнаяИнформация;
	
	Для каждого СтрокаКИ Из КИПациента Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Телефон}", СтрокаКи.Представление);  		
		Иначеесли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(СтрокаКИ.ЗначенияПолей);    		
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Субъет}", ?(ЗначениеЗаполнено(СтруктураАдреса.Страна), СтруктураАдреса.Страна, ""));			
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Район}", ?(ЗначениеЗаполнено(СтруктураАдреса.Район), СтруктураАдреса.Район, ""));  			
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Город}", ?(ЗначениеЗаполнено(СтруктураАдреса.Город), СтруктураАдреса.Город, ""));  			
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НаселенныйПунт}", ?(ЗначениеЗаполнено(СтруктураАдреса.НаселенныйПункт), СтруктураАдреса.НаселенныйПункт, ""));  			
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Улица}", ?(ЗначениеЗаполнено(СтруктураАдреса.Улица), СтруктураАдреса.Улица, ""));                     			
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Дом}", ?(ЗначениеЗаполнено(СтруктураАдреса.Здание.Номер), СтруктураАдреса.Здание.Номер, ""));                		
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Квартира}", ?(ЗначениеЗаполнено(СтруктураАдреса.Помещения), СтруктураАдреса.Помещения[0].Номер, ""));
		КонецЕсли;
	КонецЦикла;   
	
	// Заполняем полис
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ПолисыМедицинскогоСтрахования.СерияПолиса КАК СерияПолиса,
	|	ПолисыМедицинскогоСтрахования.НомерПолиса КАК НомерПолиса,
	| ПолисыМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
	|ИЗ
	|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	|ГДЕ
	|	ПолисыМедицинскогоСтрахования.Контрагент = &Пациент
	|	И ПолисыМедицинскогоСтрахования.ТипПолиса = ЗНАЧЕНИЕ(Перечисление.ТипыПолиса.ОбязательноеМедицинскоеСтрахование)");
	Запрос.УстановитьПараметр("Пациент", КартаОртодонтическогоПациента.ВладелецКарты);
	Выборка = Запрос.Выполнить().Выбрать();     
	
	Пока Выборка.Следующий() Цикл	                                 		
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СерияПолиса}", ?(ЗначениеЗаполнено(Выборка.СерияПолиса), Выборка.СерияПолиса, ""));    
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НомерПолиса}", ?(ЗначениеЗаполнено(Выборка.НомерПолиса), Выборка.НомерПолиса, ""));   
		ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СтраховаяКомпания}", ?(ЗначениеЗаполнено(Выборка.СтраховаяКомпания), Выборка.СтраховаяКомпания, ""));   
	КонецЦикла;
	
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДокументыФизическихЛиц.Серия КАК Серия,
	|	ДокументыФизическихЛиц.Номер КАК Номер,
	|	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|ГДЕ
	|	ДокументыФизическихЛиц.Физлицо = &Пациент");
	Запрос.УстановитьПараметр("Пациент", КартаОртодонтическогоПациента.ВладелецКарты);
	Выборка = Запрос.Выполнить().Выбрать();     
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СНИЛС Тогда			
			Если ЗначениеЗаполнено(Выборка.Серия) ИЛИ ЗначениеЗаполнено(Выборка.Номер) ИЛИ ЗначениеЗаполнено(Выборка.КемВыдан) Тогда
				ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СНИЛС}", " Серия: " + Выборка.Серия + " № " +  Выборка.Номер + "  выдан: " + Выборка.КемВыдан);    		
			КонецЕсли;
		Иначе
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СерияДокумента}", ?(ЗначениеЗаполнено(Выборка.Серия), Выборка.Серия, ""));    
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НомерДокумента}", ?(ЗначениеЗаполнено(Выборка.Номер), Выборка.Номер, ""));   
			ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{КемВыдан}", ?(ЗначениеЗаполнено(Выборка.КемВыдан), Выборка.КемВыдан, ""));   
		КонецЕсли;
	КонецЦикла; 	
	
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Субъет}", "");			
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Район}", "");  			
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Город}", "");  			
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НаселенныйПунт}", "");  			
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Улица}", "");                     			
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Дом}", "");                		
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{Квартира}", "");
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СерияПолиса}", "");    
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НомерПолиса}", "");   
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СтраховаяКомпания}", "");   
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СНИЛС}", "");
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{КемВыдан}", "");
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{СерияДокумента}", "");    
	ПолеТекстHTML = СтрЗаменить(ПолеТекстHTML, "{НомерДокумента}", "");
		
КонецПроцедуры    

&НаКлиенте          
// Процедура вызывается при нажатии
Процедура ПолеТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия <> Неопределено Тогда                     		
		Если ДанныеСобытия.Element.innerHTML = "Добавить строку" Тогда
		Иначеесли ДанныеСобытия.Element.innerHTML = "Удалить строку" Тогда
			
			table = Элементы.ПолеТекстHTML.Документ.getElementById("Tablenabl");
			rowCount = table.rows.length;     			
			table.deleteRow(rowCount-1);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
// Процедура вызывает сохранение макета в реквизит справочника.
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)   	
	
	Если ЗавершениеРаботы Тогда
		Возврат;    
	Иначе  
		Если СохранениеПроизведено = Ложь Тогда
			ПредыдущийТекстДокумента = ПолеТекстHTML;
			// заполнение элементов textarea
			ЭлементыTextarea = Элементы.ПолеТекстHTML.Документ.querySelectorAll("textarea");
			Для каждого ЭлементHTML Из ЭлементыTextarea Цикл
				ЭлементHTML.TextContent = ЭлементHTML.Value; 
			КонецЦикла; 
			
			// заполнение элементов 
			ЭлементыInputCheckboxRadio = Элементы.ПолеТекстHTML.Документ.querySelectorAll("input");
			Для каждого ЭлементHTML Из ЭлементыInputCheckboxRadio Цикл
				Если ЭлементHTML.type = "checkbox" ИЛИ ЭлементHTML.type = "radio" Тогда            
					Если ЭлементHTML.Checked = Истина Тогда				
						ЭлементHTML.defaultChecked = Истина;				
					ИначеЕсли ЭлементHTML.Checked = Ложь Тогда
						ЭлементHTML.defaultChecked = Ложь;				
					КонецЕсли;			
				КонецЕсли;		
				
				Если ЭлементHTML.type = "text" Тогда            			
					ЭлементHTML.textContent  = ЭлементHTML.Value;
					ЭлементHTML.defaultValue = ЭлементHTML.Value;
				КонецЕсли;
			КонецЦикла;   	
			
			ПолеТекстHTML = Элементы.ПолеТекстHTML.Документ.documentElement.outerHTML;	
			
			Если ПредыдущийТекстДокумента <> ПолеТекстHTML Тогда
				Отказ = Истина;
				Оповещение = Новый ОписаниеОповещения("СохранениеДанныхНаКлиенте", ЭтотОбъект);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Данные были изменены, сохранить?'"), РежимДиалогаВопрос.ДаНет);					
			Иначе
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте 
// Процедура Сохранение данных на клиенте.
//
Процедура СохранениеДанныхНаКлиенте(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Закрыть(); 
	Иначе 
		АдресПечатнойФормы = ДействиеОКСервер();			
		Записать();
		СохранениеПроизведено = Истина;	
		Закрыть();	   		
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере  
// Процедура Действие Ок Сервер.
//
Функция ДействиеОКСервер()	
	
	Возврат ПоместитьВоВременноеХранилище(ПолеТекстHTML, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере                                                            
// Процедура Перед записью на сервере.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ТекущийОбъект.ПечатнаяФорма = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПечатнойФормы));
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте   
// Процедура перехода по главам.
//
Процедура ОсновныеДанные(Команда)                  	
	
	ПунктОглавления = ТекущийЭлемент.Имя;
	
	Если ПунктОглавления = "ОсновныеДанные" Тогда
		ИмяЭлемента = "top";
	ИначеЕсли ПунктОглавления = "Жалобы" Тогда
		ИмяЭлемента = "estet";     
	ИначеЕсли ПунктОглавления = "Анамнез" Тогда
		ИмяЭлемента = "rojd1";
	ИначеЕсли ПунктОглавления = "Кефалометрия" Тогда
		ИмяЭлемента = "kefalometria";
	ИначеЕсли ПунктОглавления = "ОсмотрПолостиРта" Тогда
		ИмяЭлемента = "uzd1";
	ИначеЕсли ПунктОглавления = "РентгенологическоеИсследование" Тогда
		ИмяЭлемента = "rentgen";                     
	ИначеЕсли ПунктОглавления = "ФункциональныеМетодыИсследования" Тогда
		ИмяЭлемента = "prof1"; 	
	ИначеЕсли ПунктОглавления = "КлиническийДиагноз" Тогда
		ИмяЭлемента = "KlinicDiagnoz"; 	                  
	ИначеЕсли ПунктОглавления = "ПланЛечения" Тогда
		ИмяЭлемента = "PlanLechenia"; 	
	ИначеЕсли ПунктОглавления = "ДневникВрачаОртодонта" Тогда
		ИмяЭлемента = "dnevnik"; 	
	ИначеЕсли ПунктОглавления = "Наблюдение" Тогда
		ИмяЭлемента = "nabludenie"; 	
	ИначеЕсли ПунктОглавления = "ЭтапныйЭпикриз" Тогда
		ИмяЭлемента = "epikriz"; 		
	КонецЕсли;                 
	
	Если ИмяЭлемента <> Неопределено Тогда    
		
		РезультатПоиска = Элементы.ПолеТекстHTML.Документ.getElementById(ИмяЭлемента);
		
		Если РезультатПоиска = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		РезультатПоиска.scrollIntoViewIfNeeded(Истина);   
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
